<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<!-- placeholder-3 -->
<details><summary>Plan: 4 to add, 2 to change, 4 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-07-11T03:31:30Z [(view log)](https://github.com/perchnet/p/actions/runs/16211140094/job/45771290502#step:10:1).
</summary>

```hcl

Error: error reading repository vulnerability alerts: GET https://api.github.com/repos/perchnet/p/vulnerability-alerts: 403 Resource not accessible by integration []

  with github_repository.p_repository,
  on github.tf line 7, in resource "github_repository" "p_repository":
   7: resource "github_repository" "p_repository" {

le.coreos-module-vm.random_pet.random_hostname: Refreshing state... [id=stunning-bear]
module.coreos-module-vm2.data.http.coreos_stream_metadata: Reading...
data.onepassword_vault.perchnet_vault: Reading...
module.coreos-module-vm2.data.http.coreos_stream_metadata: Read complete after 0s [id=https://builds.coreos.fedoraproject.org/streams/testing.json]
module.coreos-module-vm.data.http.coreos_stream_metadata: Read complete after 0s [id=https://builds.coreos.fedoraproject.org/streams/testing.json]
github_repository.p_repository: Refreshing state... [id=p]
data.onepassword_vault.perchnet_vault: Read complete after 0s [id=vaults/xjvmoejfpwbuvwpelaxjicxo3e]
data.onepassword_item.proxmox_token: Reading...
data.onepassword_item.proxmox_api: Reading...
data.onepassword_item.proxmox_ssh: Reading...
onepassword_item.coreos_module_password: Refreshing state... [id=vaults/xjvmoejfpwbuvwpelaxjicxo3e/items/tuxgnqcf7r7hufpglsvwf7sboe]
module.coreos-module-vm.terraform_data.password_hash: Refreshing state... [id=037957e1-3291-5b47-a864-5cbdc48fedce]
module.coreos-module-vm2.terraform_data.password_hash: Refreshing state... [id=19cc5958-94f8-0ed0-c76e-995d79afa60a]
data.onepassword_item.proxmox_ssh: Read complete after 1s [id=vaults/xjvmoejfpwbuvwpelaxjicxo3e/items/7sa3h66bvyxryglelfxsruzzhu]
data.onepassword_item.proxmox_token: Read complete after 1s [id=vaults/xjvmoejfpwbuvwpelaxjicxo3e/items/lw4widnu7ncnoxn7q4kaomwmtu]
data.onepassword_item.proxmox_api: Read complete after 1s [id=vaults/xjvmoejfpwbuvwpelaxjicxo3e/items/cig4t223gv7xmcrzdxtwmtffx4]
proxmox_virtual_environment_download_file.debian_trixie_qcow2_generic: Refreshing state... [id=zssd-files:iso/debian-13-genericcloud-amd64.qcow2.img]
proxmox_virtual_environment_download_file.ubuntu_jammy_cloud_image: Refreshing state... [id=zssd-files:iso/jammy-server-cloudimg-amd64.img]
module.coreos-module-vm.proxmox_virtual_environment_file.cloud_user_config: Refreshing state... [id=snippets:snippets/stunning-bear.xd9o08.butane-ci-user-data.ign]
proxmox_virtual_environment_download_file.ubuntu_noble_cloud_image: Refreshing state... [id=zssd-files:iso/ubuntu-24.04-cloudimg-amd64.qcow.iso]
module.coreos-module-vm2.proxmox_virtual_environment_download_file.coreos_img: Refreshing state... [id=zssd-files:iso/coreos_testing_proxmoxve_mth6bp.qcow2.xz.img]
proxmox_virtual_environment_download_file.debian_bookworm_qcow2_generic: Refreshing state... [id=zssd-files:iso/debian-12-nocloud-amd64.qcow2.img]
module.coreos-module-vm.proxmox_virtual_environment_download_file.coreos_img: Refreshing state... [id=zssd-files:iso/coreos_testing_proxmoxve_xd9o08.qcow2.xz.img]
module.coreos-module-vm2.proxmox_virtual_environment_file.cloud_user_config: Refreshing state... [id=snippets:snippets/up-unicorn.mth6bp.butane-ci-user-data.ign]
module.coreos-module-vm.proxmox_virtual_environment_vm.coreos_vm: Refreshing state... [id=131]
module.coreos-module-vm2.proxmox_virtual_environment_vm.coreos_vm: Refreshing state... [id=132]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.coreos-module-vm.data.ct_config.fedora-coreos-config will be read during apply
  # (config refers to values not yet known)
 <= data "ct_config" "fedora-coreos-config" {
      + content      = (sensitive value)
      + id           = (known after apply)
      + pretty_print = true
      + rendered     = (known after apply)
      + snippets     = [
          + <<-EOT
                variant: fcos
                version: 1.5.0
                storage:
                  files:
                    - path: /etc/zincati/config.d/90-disable-feature.toml
                      contents:
                        inline: |
                          [updates]
                          enabled = false
            EOT,
        ]
      + strict       = true
    }

  # module.coreos-module-vm.proxmox_virtual_environment_file.cloud_user_config must be replaced
-/+ resource "proxmox_virtual_environment_file" "cloud_user_config" {
      + file_modification_date = (known after apply)
      ~ file_name              = "stunning-bear.xd9o08.butane-ci-user-data.ign" -> (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      ~ id                     = "snippets:snippets/stunning-bear.xd9o08.butane-ci-user-data.ign" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ source_raw {
          ~ data      = jsonencode(
                {
                  - ignition        = {
                      - config   = {
                          - replace = {
                              - verification = {}
                            }
                        }
                      - proxy    = {}
                      - security = {
                          - tls = {}
                        }
                      - timeouts = {}
                      - version  = "3.4.0"
                    }
                  - kernelArguments = {}
                  - passwd          = {
                      - users = [
                          - {
                              - name              = "core"
                              - passwordHash      = "$2a$10$onT38IxJmh03id2kdEArk.95.ILdBeAfEXaTwa76AkqkgU3BVccB6"
                              - sshAuthorizedKeys = [
                                  - "ssh-key ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAILUTdPEpjE/Hjbn9jNITSAYkYWTgtTLcXW8QyfTOu2Fq",
                                ]
                            },
                        ]
                    }
                  - storage         = {
                      - files = [
                          - {
                              - contents  = {
                                  - compression  = ""
                                  - source       = "data:,Hello%20World!%0A"
                                  - verification = {}
                                }
                              - group     = {}
                              - mode      = 420
                              - overwrite = true
                              - path      = "/etc/motd"
                              - user      = {}
                            },
                          - {
                              - contents  = {
                                  - compression  = ""
                                  - source       = "data:,stunning-bear"
                                  - verification = {}
                                }
                              - group     = {}
                              - mode      = 420
                              - overwrite = true
                              - path      = "/etc/hostname"
                              - user      = {}
                            },
                          - {
                              - contents = {
                                  - compression  = ""
                                  - source       = "data:,%5Bupdates%5D%0Aenabled%20%3D%20false%0A"
                                  - verification = {}
                                }
                              - group    = {}
                              - path     = "/etc/zincati/config.d/90-disable-feature.toml"
                              - user     = {}
                            },
                        ]
                    }
                  - systemd         = {}
                }
            ) -> (known after apply) # forces replacement
            # (2 unchanged attributes hidden)
        }
    }

  # module.coreos-module-vm.proxmox_virtual_environment_vm.coreos_vm must be replaced
-/+ resource "proxmox_virtual_environment_vm" "coreos_vm" {
      ~ id                      = "131" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "BC:24:11:B3:7B:C1",
        ] -> (known after apply)
        name                    = "stunning-bear"
      ~ network_interface_names = [] -> (known after apply)
        tags                    = [
            "terraform",
        ]
      ~ vm_id                   = 131 -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ disk {
          ~ file_format       = "raw" -> (known after apply)
          ~ path_in_datastore = "vm-131-disk-0" -> (known after apply)
            # (13 unchanged attributes hidden)
        }

      ~ initialization {
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          ~ user_data_file_id    = "snippets:snippets/stunning-bear.xd9o08.butane-ci-user-data.ign" -> (known after apply) # forces replacement
          + vendor_data_file_id  = (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:B3:7B:C1" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.coreos-module-vm.terraform_data.password_hash will be updated in-place
  ~ resource "terraform_data" "password_hash" {
        id               = "037957e1-3291-5b47-a864-5cbdc48fedce"
      ~ input            = (sensitive value)
      ~ output           = "$2a$10$onT38IxJmh03id2kdEArk.95.ILdBeAfEXaTwa76AkqkgU3BVccB6" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.coreos-module-vm2.data.ct_config.fedora-coreos-config will be read during apply
  # (config refers to values not yet known)
 <= data "ct_config" "fedora-coreos-config" {
      + content      = (sensitive value)
      + id           = (known after apply)
      + pretty_print = true
      + rendered     = (known after apply)
      + snippets     = [
          + <<-EOT
                variant: fcos
                version: 1.5.0
                storage:
                  files:
                    - path: /etc/zincati/config.d/90-disable-feature.toml
                      contents:
                        inline: |
                          [updates]
                          enabled = false
            EOT,
        ]
      + strict       = true
    }

  # module.coreos-module-vm2.proxmox_virtual_environment_file.cloud_user_config must be replaced
-/+ resource "proxmox_virtual_environment_file" "cloud_user_config" {
      + file_modification_date = (known after apply)
      ~ file_name              = "up-unicorn.mth6bp.butane-ci-user-data.ign" -> (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      ~ id                     = "snippets:snippets/up-unicorn.mth6bp.butane-ci-user-data.ign" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ source_raw {
          ~ data      = jsonencode(
                {
                  - ignition        = {
                      - config   = {
                          - replace = {
                              - verification = {}
                            }
                        }
                      - proxy    = {}
                      - security = {
                          - tls = {}
                        }
                      - timeouts = {}
                      - version  = "3.4.0"
                    }
                  - kernelArguments = {}
                  - passwd          = {
                      - users = [
                          - {
                              - name              = "core"
                              - passwordHash      = "$2a$10$ZIFjdmEYhdOlFQBNtI.cQuj/W7.bQjD91JnZy5XPB8UsYLTx/EW0q"
                              - sshAuthorizedKeys = [
                                  - "ssh-key ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAILUTdPEpjE/Hjbn9jNITSAYkYWTgtTLcXW8QyfTOu2Fq",
                                ]
                            },
                        ]
                    }
                  - storage         = {
                      - files = [
                          - {
                              - contents  = {
                                  - compression  = ""
                                  - source       = "data:,Hello%20World!%0A"
                                  - verification = {}
                                }
                              - group     = {}
                              - mode      = 420
                              - overwrite = true
                              - path      = "/etc/motd"
                              - user      = {}
                            },
                          - {
                              - contents  = {
                                  - compression  = ""
                                  - source       = "data:,up-unicorn"
                                  - verification = {}
                                }
                              - group     = {}
                              - mode      = 420
                              - overwrite = true
                              - path      = "/etc/hostname"
                              - user      = {}
                            },
                          - {
                              - contents = {
                                  - compression  = ""
                                  - source       = "data:,%5Bupdates%5D%0Aenabled%20%3D%20false%0A"
                                  - verification = {}
                                }
                              - group    = {}
                              - path     = "/etc/zincati/config.d/90-disable-feature.toml"
                              - user     = {}
                            },
                        ]
                    }
                  - systemd         = {}
                }
            ) -> (known after apply) # forces replacement
            # (2 unchanged attributes hidden)
        }
    }

  # module.coreos-module-vm2.proxmox_virtual_environment_vm.coreos_vm must be replaced
-/+ resource "proxmox_virtual_environment_vm" "coreos_vm" {
      ~ id                      = "132" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "BC:24:11:0E:88:A6",
        ] -> (known after apply)
        name                    = "up-unicorn"
      ~ network_interface_names = [] -> (known after apply)
        tags                    = [
            "terraform",
        ]
      ~ vm_id                   = 132 -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ disk {
          ~ file_format       = "raw" -> (known after apply)
          ~ path_in_datastore = "vm-132-disk-0" -> (known after apply)
            # (13 unchanged attributes hidden)
        }

      ~ initialization {
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          ~ user_data_file_id    = "snippets:snippets/up-unicorn.mth6bp.butane-ci-user-data.ign" -> (known after apply) # forces replacement
          + vendor_data_file_id  = (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:0E:88:A6" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.coreos-module-vm2.terraform_data.password_hash will be updated in-place
  ~ resource "terraform_data" "password_hash" {
        id               = "19cc5958-94f8-0ed0-c76e-995d79afa60a"
      ~ input            = (sensitive value)
      ~ output           = "$2a$10$ZIFjdmEYhdOlFQBNtI.cQuj/W7.bQjD91JnZy5XPB8UsYLTx/EW0q" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 4 to add, 2 to change, 4 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-14-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->